graph(%self : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Models.Transformer,
      %src_seq.1 : Tensor,
      %trg_seq.1 : Tensor):
  %1474 : int[] = prim::Constant[value=[512]]()
  %18 : int = prim::Constant[value=-1]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:175:30
  %17 : int = prim::Constant[value=2]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:175:49
  %16 : int = prim::Constant[value=-2]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:12:38
  %15 : int = prim::Constant[value=1]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:18:23
  %14 : None = prim::Constant()
  %13 : int = prim::Constant[value=11]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:19:74
  %12 : bool = prim::Constant[value=0]()
  %11 : float = prim::Constant[value=-1000000000.]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:21:47
  %10 : int = prim::Constant[value=3]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:65
  %9 : float = prim::Constant[value=9.9999999999999995e-07]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/normalization.py:171:66
  %7 : bool = prim::Constant[value=1]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:72
  %6 : float = prim::Constant[value=0.10000000000000001]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/dropout.py:58:32
  %5 : int = prim::Constant[value=9223372036854775807]()
  %4 : int = prim::Constant[value=0]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1896:25
  %3 : str = prim::Constant[value="AssertionError: Padding_idx must be within num_embeddings"]()
  %19 : int = prim::GetAttr[name="src_pad_idx"](%self)
  %20 : Tensor = aten::ne(%src_seq.1, %19) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:12:12
  %src_mask.1 : Tensor = aten::unsqueeze(%20, %16) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:12:12
  %22 : int = prim::GetAttr[name="trg_pad_idx"](%self)
  %23 : Tensor = aten::ne(%trg_seq.1, %22) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:12:12
  %24 : Tensor = aten::unsqueeze(%23, %16) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:12:12
  %25 : int[] = aten::size(%trg_seq.1) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:17:18
  %sz_b : int, %len_s.1 : int = prim::ListUnpack(%25)
  %28 : Device = prim::device(%trg_seq.1)
  %29 : int[] = prim::ListConstruct(%15, %len_s.1, %len_s.1)
  %30 : Tensor = aten::ones(%29, %14, %14, %28, %14) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:19:8
  %31 : Tensor = aten::triu(%30, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:18:27
  %32 : Tensor = aten::neg(%31) # <string>:19:9
  %33 : Tensor = aten::add(%32, %15, %15) # <string>:19:9
  %subsequent_mask.1 : Tensor = aten::to(%33, %13, %12, %12, %14) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:18:23
  %trg_mask.1 : Tensor = aten::__and__(%24, %subsequent_mask.1) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:169:19
  %36 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Models.Encoder = prim::GetAttr[name="encoder"](%self)
  %37 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%36)
  %38 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Models.PositionalEncoding = prim::GetAttr[name="position_enc"](%36)
  %39 : __torch__.torch.nn.modules.sparse.Embedding = prim::GetAttr[name="src_word_emb"](%36)
  %40 : Tensor = prim::GetAttr[name="weight"](%39)
  %41 : int = aten::size(%40, %4) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1897:33
  %42 : bool = aten::lt(%15, %41) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1897:19
   = prim::If(%42) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1897:12
    block0():
      -> ()
    block1():
       = prim::RaiseException(%3) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1897:12
      -> ()
  %43 : Tensor = aten::embedding(%40, %src_seq.1, %15, %12, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1913:11
  %44 : Tensor = prim::GetAttr[name="pos_table"](%38)
  %45 : Tensor = aten::slice(%44, %4, %4, %5, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:45:19
  %46 : int = aten::size(%43, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:45:38
  %47 : Tensor = aten::slice(%45, %15, %4, %46, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:45:19
  %48 : Tensor = aten::clone(%47, %14) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:45:19
  %49 : Tensor = aten::detach(%48) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:45:19
  %50 : Tensor = aten::add(%43, %49, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Models.py:45:15
  %51 : bool = prim::GetAttr[name="training"](%37)
  %enc_output.2 : Tensor = aten::dropout(%50, %6, %51) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %53 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%36)
  %54 : Tensor = prim::GetAttr[name="weight"](%53)
  %55 : Tensor = prim::GetAttr[name="bias"](%53)
  %enc_output.4 : Tensor = aten::layer_norm(%enc_output.2, %1474, %54, %55, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %58 : __torch__.torch.nn.modules.container.___torch_mangle_58.ModuleList = prim::GetAttr[name="layer_stack"](%36)
  %59 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Layers.EncoderLayer = prim::GetAttr[name="0"](%58)
  %60 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Layers.EncoderLayer = prim::GetAttr[name="1"](%58)
  %61 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Layers.EncoderLayer = prim::GetAttr[name="2"](%58)
  %62 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Layers.EncoderLayer = prim::GetAttr[name="3"](%58)
  %63 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Layers.EncoderLayer = prim::GetAttr[name="4"](%58)
  %64 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Layers.EncoderLayer = prim::GetAttr[name="5"](%58)
  %65 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.MultiHeadAttention = prim::GetAttr[name="slf_attn"](%59)
  %d_k.17 : int = prim::GetAttr[name="d_k"](%65)
  %d_v.17 : int = prim::GetAttr[name="d_v"](%65)
  %n_head.17 : int = prim::GetAttr[name="n_head"](%65)
  %sz_b.17 : int = aten::size(%enc_output.4, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:36
  %len_q.17 : int = aten::size(%enc_output.4, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:47
  %73 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_qs"](%65)
  %74 : Tensor = prim::GetAttr[name="weight"](%73)
  %75 : Tensor = aten::linear(%enc_output.4, %74, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %76 : int[] = prim::ListConstruct(%sz_b.17, %len_q.17, %n_head.17, %d_k.17)
  %q.118 : Tensor = aten::view(%75, %76) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:41:12
  %78 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_ks"](%65)
  %79 : Tensor = prim::GetAttr[name="weight"](%78)
  %80 : Tensor = aten::linear(%enc_output.4, %79, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %k.36 : Tensor = aten::view(%80, %76) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:42:12
  %83 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_vs"](%65)
  %84 : Tensor = prim::GetAttr[name="weight"](%83)
  %85 : Tensor = aten::linear(%enc_output.4, %84, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %86 : int[] = prim::ListConstruct(%sz_b.17, %len_q.17, %n_head.17, %d_v.17)
  %v.36 : Tensor = aten::view(%85, %86) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:43:12
  %q.119 : Tensor = aten::transpose(%q.118, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:18
  %k.37 : Tensor = aten::transpose(%k.36, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:37
  %v.37 : Tensor = aten::transpose(%v.36, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:56
  %mask.10 : Tensor = aten::unsqueeze(%src_mask.1, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:49:19
  %92 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Modules.ScaledDotProductAttention = prim::GetAttr[name="attention"](%65)
  %93 : float = prim::GetAttr[name="temperature"](%92)
  %94 : Tensor = aten::div(%q.119, %93) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:28
  %95 : Tensor = aten::transpose(%k.37, %17, %10) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:50
  %attn.80 : Tensor = aten::matmul(%94, %95) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:15
  %97 : Tensor = aten::eq(%mask.10, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:21:36
  %attn.82 : Tensor = aten::masked_fill(%attn.80, %97, %11) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:21:19
  %99 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%92)
  %ret.17 : Tensor = aten::softmax(%attn.82, %18, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1583:14
  %101 : bool = prim::GetAttr[name="training"](%99)
  %attn.83 : Tensor = aten::dropout(%ret.17, %6, %101) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %output.17 : Tensor = aten::matmul(%attn.83, %v.37) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:24:17
  %107 : Tensor = aten::transpose(%output.17, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %108 : Tensor = aten::contiguous(%107, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %109 : int[] = prim::ListConstruct(%sz_b.17, %len_q.17, %18)
  %q.121 : Tensor = aten::view(%108, %109) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %111 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%65)
  %112 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="fc"](%65)
  %113 : Tensor = prim::GetAttr[name="weight"](%112)
  %114 : Tensor = aten::linear(%q.121, %113, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %115 : bool = prim::GetAttr[name="training"](%111)
  %q.122 : Tensor = aten::dropout(%114, %6, %115) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %q.123 : Tensor = aten::add_(%q.122, %enc_output.4, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:57:8
  %118 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%65)
  %119 : Tensor = prim::GetAttr[name="weight"](%118)
  %120 : Tensor = prim::GetAttr[name="bias"](%118)
  %q.124 : Tensor = aten::layer_norm(%q.123, %1474, %119, %120, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %126 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.PositionwiseFeedForward = prim::GetAttr[name="pos_ffn"](%59)
  %127 : __torch__.torch.nn.modules.linear.___torch_mangle_57.Linear = prim::GetAttr[name="w_2"](%126)
  %128 : __torch__.torch.nn.modules.linear.___torch_mangle_56.Linear = prim::GetAttr[name="w_1"](%126)
  %129 : Tensor = prim::GetAttr[name="weight"](%128)
  %130 : Tensor = prim::GetAttr[name="bias"](%128)
  %131 : Tensor = aten::linear(%q.124, %129, %130) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %result.8 : Tensor = aten::relu(%131) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %133 : Tensor = prim::GetAttr[name="weight"](%127)
  %134 : Tensor = prim::GetAttr[name="bias"](%127)
  %x.22 : Tensor = aten::linear(%result.8, %133, %134) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %136 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%126)
  %137 : bool = prim::GetAttr[name="training"](%136)
  %x.23 : Tensor = aten::dropout(%x.22, %6, %137) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %x.24 : Tensor = aten::add_(%x.23, %q.124, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:80:8
  %140 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%126)
  %141 : Tensor = prim::GetAttr[name="weight"](%140)
  %142 : Tensor = prim::GetAttr[name="bias"](%140)
  %enc_output.8 : Tensor = aten::layer_norm(%x.24, %1474, %141, %142, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %148 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.MultiHeadAttention = prim::GetAttr[name="slf_attn"](%60)
  %d_k.15 : int = prim::GetAttr[name="d_k"](%148)
  %d_v.15 : int = prim::GetAttr[name="d_v"](%148)
  %n_head.15 : int = prim::GetAttr[name="n_head"](%148)
  %sz_b.15 : int = aten::size(%enc_output.8, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:36
  %len_q.15 : int = aten::size(%enc_output.8, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:47
  %156 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_qs"](%148)
  %157 : Tensor = prim::GetAttr[name="weight"](%156)
  %158 : Tensor = aten::linear(%enc_output.8, %157, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %159 : int[] = prim::ListConstruct(%sz_b.15, %len_q.15, %n_head.15, %d_k.15)
  %q.104 : Tensor = aten::view(%158, %159) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:41:12
  %161 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_ks"](%148)
  %162 : Tensor = prim::GetAttr[name="weight"](%161)
  %163 : Tensor = aten::linear(%enc_output.8, %162, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %k.32 : Tensor = aten::view(%163, %159) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:42:12
  %166 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_vs"](%148)
  %167 : Tensor = prim::GetAttr[name="weight"](%166)
  %168 : Tensor = aten::linear(%enc_output.8, %167, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %169 : int[] = prim::ListConstruct(%sz_b.15, %len_q.15, %n_head.15, %d_v.15)
  %v.32 : Tensor = aten::view(%168, %169) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:43:12
  %q.105 : Tensor = aten::transpose(%q.104, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:18
  %k.33 : Tensor = aten::transpose(%k.32, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:37
  %v.33 : Tensor = aten::transpose(%v.32, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:56
  %175 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Modules.ScaledDotProductAttention = prim::GetAttr[name="attention"](%148)
  %176 : float = prim::GetAttr[name="temperature"](%175)
  %177 : Tensor = aten::div(%q.105, %176) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:28
  %178 : Tensor = aten::transpose(%k.33, %17, %10) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:50
  %attn.70 : Tensor = aten::matmul(%177, %178) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:15
  %attn.72 : Tensor = aten::masked_fill(%attn.70, %97, %11) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:21:19
  %182 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%175)
  %ret.15 : Tensor = aten::softmax(%attn.72, %18, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1583:14
  %184 : bool = prim::GetAttr[name="training"](%182)
  %attn.73 : Tensor = aten::dropout(%ret.15, %6, %184) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %output.15 : Tensor = aten::matmul(%attn.73, %v.33) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:24:17
  %190 : Tensor = aten::transpose(%output.15, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %191 : Tensor = aten::contiguous(%190, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %192 : int[] = prim::ListConstruct(%sz_b.15, %len_q.15, %18)
  %q.107 : Tensor = aten::view(%191, %192) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %194 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%148)
  %195 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="fc"](%148)
  %196 : Tensor = prim::GetAttr[name="weight"](%195)
  %197 : Tensor = aten::linear(%q.107, %196, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %198 : bool = prim::GetAttr[name="training"](%194)
  %q.108 : Tensor = aten::dropout(%197, %6, %198) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %q.109 : Tensor = aten::add_(%q.108, %enc_output.8, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:57:8
  %201 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%148)
  %202 : Tensor = prim::GetAttr[name="weight"](%201)
  %203 : Tensor = prim::GetAttr[name="bias"](%201)
  %q.110 : Tensor = aten::layer_norm(%q.109, %1474, %202, %203, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %209 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.PositionwiseFeedForward = prim::GetAttr[name="pos_ffn"](%60)
  %210 : __torch__.torch.nn.modules.linear.___torch_mangle_57.Linear = prim::GetAttr[name="w_2"](%209)
  %211 : __torch__.torch.nn.modules.linear.___torch_mangle_56.Linear = prim::GetAttr[name="w_1"](%209)
  %212 : Tensor = prim::GetAttr[name="weight"](%211)
  %213 : Tensor = prim::GetAttr[name="bias"](%211)
  %214 : Tensor = aten::linear(%q.110, %212, %213) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %result.9 : Tensor = aten::relu(%214) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %216 : Tensor = prim::GetAttr[name="weight"](%210)
  %217 : Tensor = prim::GetAttr[name="bias"](%210)
  %x.25 : Tensor = aten::linear(%result.9, %216, %217) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %219 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%209)
  %220 : bool = prim::GetAttr[name="training"](%219)
  %x.26 : Tensor = aten::dropout(%x.25, %6, %220) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %x.27 : Tensor = aten::add_(%x.26, %q.110, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:80:8
  %223 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%209)
  %224 : Tensor = prim::GetAttr[name="weight"](%223)
  %225 : Tensor = prim::GetAttr[name="bias"](%223)
  %enc_output.12 : Tensor = aten::layer_norm(%x.27, %1474, %224, %225, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %231 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.MultiHeadAttention = prim::GetAttr[name="slf_attn"](%61)
  %d_k.16 : int = prim::GetAttr[name="d_k"](%231)
  %d_v.16 : int = prim::GetAttr[name="d_v"](%231)
  %n_head.16 : int = prim::GetAttr[name="n_head"](%231)
  %sz_b.16 : int = aten::size(%enc_output.12, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:36
  %len_q.16 : int = aten::size(%enc_output.12, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:47
  %239 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_qs"](%231)
  %240 : Tensor = prim::GetAttr[name="weight"](%239)
  %241 : Tensor = aten::linear(%enc_output.12, %240, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %242 : int[] = prim::ListConstruct(%sz_b.16, %len_q.16, %n_head.16, %d_k.16)
  %q.111 : Tensor = aten::view(%241, %242) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:41:12
  %244 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_ks"](%231)
  %245 : Tensor = prim::GetAttr[name="weight"](%244)
  %246 : Tensor = aten::linear(%enc_output.12, %245, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %k.34 : Tensor = aten::view(%246, %242) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:42:12
  %249 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_vs"](%231)
  %250 : Tensor = prim::GetAttr[name="weight"](%249)
  %251 : Tensor = aten::linear(%enc_output.12, %250, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %252 : int[] = prim::ListConstruct(%sz_b.16, %len_q.16, %n_head.16, %d_v.16)
  %v.34 : Tensor = aten::view(%251, %252) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:43:12
  %q.112 : Tensor = aten::transpose(%q.111, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:18
  %k.35 : Tensor = aten::transpose(%k.34, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:37
  %v.35 : Tensor = aten::transpose(%v.34, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:56
  %258 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Modules.ScaledDotProductAttention = prim::GetAttr[name="attention"](%231)
  %259 : float = prim::GetAttr[name="temperature"](%258)
  %260 : Tensor = aten::div(%q.112, %259) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:28
  %261 : Tensor = aten::transpose(%k.35, %17, %10) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:50
  %attn.75 : Tensor = aten::matmul(%260, %261) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:15
  %attn.77 : Tensor = aten::masked_fill(%attn.75, %97, %11) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:21:19
  %265 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%258)
  %ret.16 : Tensor = aten::softmax(%attn.77, %18, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1583:14
  %267 : bool = prim::GetAttr[name="training"](%265)
  %attn.78 : Tensor = aten::dropout(%ret.16, %6, %267) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %output.16 : Tensor = aten::matmul(%attn.78, %v.35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:24:17
  %273 : Tensor = aten::transpose(%output.16, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %274 : Tensor = aten::contiguous(%273, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %275 : int[] = prim::ListConstruct(%sz_b.16, %len_q.16, %18)
  %q.114 : Tensor = aten::view(%274, %275) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %277 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%231)
  %278 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="fc"](%231)
  %279 : Tensor = prim::GetAttr[name="weight"](%278)
  %280 : Tensor = aten::linear(%q.114, %279, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %281 : bool = prim::GetAttr[name="training"](%277)
  %q.115 : Tensor = aten::dropout(%280, %6, %281) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %q.116 : Tensor = aten::add_(%q.115, %enc_output.12, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:57:8
  %284 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%231)
  %285 : Tensor = prim::GetAttr[name="weight"](%284)
  %286 : Tensor = prim::GetAttr[name="bias"](%284)
  %q.117 : Tensor = aten::layer_norm(%q.116, %1474, %285, %286, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %292 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.PositionwiseFeedForward = prim::GetAttr[name="pos_ffn"](%61)
  %293 : __torch__.torch.nn.modules.linear.___torch_mangle_57.Linear = prim::GetAttr[name="w_2"](%292)
  %294 : __torch__.torch.nn.modules.linear.___torch_mangle_56.Linear = prim::GetAttr[name="w_1"](%292)
  %295 : Tensor = prim::GetAttr[name="weight"](%294)
  %296 : Tensor = prim::GetAttr[name="bias"](%294)
  %297 : Tensor = aten::linear(%q.117, %295, %296) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %result.10 : Tensor = aten::relu(%297) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %299 : Tensor = prim::GetAttr[name="weight"](%293)
  %300 : Tensor = prim::GetAttr[name="bias"](%293)
  %x.28 : Tensor = aten::linear(%result.10, %299, %300) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %302 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%292)
  %303 : bool = prim::GetAttr[name="training"](%302)
  %x.29 : Tensor = aten::dropout(%x.28, %6, %303) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %x.30 : Tensor = aten::add_(%x.29, %q.117, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:80:8
  %306 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%292)
  %307 : Tensor = prim::GetAttr[name="weight"](%306)
  %308 : Tensor = prim::GetAttr[name="bias"](%306)
  %enc_output.16 : Tensor = aten::layer_norm(%x.30, %1474, %307, %308, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %314 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.MultiHeadAttention = prim::GetAttr[name="slf_attn"](%62)
  %d_k.13 : int = prim::GetAttr[name="d_k"](%314)
  %d_v.13 : int = prim::GetAttr[name="d_v"](%314)
  %n_head.13 : int = prim::GetAttr[name="n_head"](%314)
  %sz_b.13 : int = aten::size(%enc_output.16, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:36
  %len_q.13 : int = aten::size(%enc_output.16, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:47
  %322 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_qs"](%314)
  %323 : Tensor = prim::GetAttr[name="weight"](%322)
  %324 : Tensor = aten::linear(%enc_output.16, %323, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %325 : int[] = prim::ListConstruct(%sz_b.13, %len_q.13, %n_head.13, %d_k.13)
  %q.90 : Tensor = aten::view(%324, %325) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:41:12
  %327 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_ks"](%314)
  %328 : Tensor = prim::GetAttr[name="weight"](%327)
  %329 : Tensor = aten::linear(%enc_output.16, %328, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %k.28 : Tensor = aten::view(%329, %325) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:42:12
  %332 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_vs"](%314)
  %333 : Tensor = prim::GetAttr[name="weight"](%332)
  %334 : Tensor = aten::linear(%enc_output.16, %333, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %335 : int[] = prim::ListConstruct(%sz_b.13, %len_q.13, %n_head.13, %d_v.13)
  %v.28 : Tensor = aten::view(%334, %335) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:43:12
  %q.91 : Tensor = aten::transpose(%q.90, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:18
  %k.29 : Tensor = aten::transpose(%k.28, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:37
  %v.29 : Tensor = aten::transpose(%v.28, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:56
  %341 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Modules.ScaledDotProductAttention = prim::GetAttr[name="attention"](%314)
  %342 : float = prim::GetAttr[name="temperature"](%341)
  %343 : Tensor = aten::div(%q.91, %342) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:28
  %344 : Tensor = aten::transpose(%k.29, %17, %10) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:50
  %attn.60 : Tensor = aten::matmul(%343, %344) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:15
  %attn.62 : Tensor = aten::masked_fill(%attn.60, %97, %11) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:21:19
  %348 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%341)
  %ret.13 : Tensor = aten::softmax(%attn.62, %18, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1583:14
  %350 : bool = prim::GetAttr[name="training"](%348)
  %attn.63 : Tensor = aten::dropout(%ret.13, %6, %350) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %output.13 : Tensor = aten::matmul(%attn.63, %v.29) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:24:17
  %356 : Tensor = aten::transpose(%output.13, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %357 : Tensor = aten::contiguous(%356, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %358 : int[] = prim::ListConstruct(%sz_b.13, %len_q.13, %18)
  %q.93 : Tensor = aten::view(%357, %358) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %360 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%314)
  %361 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="fc"](%314)
  %362 : Tensor = prim::GetAttr[name="weight"](%361)
  %363 : Tensor = aten::linear(%q.93, %362, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %364 : bool = prim::GetAttr[name="training"](%360)
  %q.94 : Tensor = aten::dropout(%363, %6, %364) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %q.95 : Tensor = aten::add_(%q.94, %enc_output.16, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:57:8
  %367 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%314)
  %368 : Tensor = prim::GetAttr[name="weight"](%367)
  %369 : Tensor = prim::GetAttr[name="bias"](%367)
  %q.96 : Tensor = aten::layer_norm(%q.95, %1474, %368, %369, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %375 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.PositionwiseFeedForward = prim::GetAttr[name="pos_ffn"](%62)
  %376 : __torch__.torch.nn.modules.linear.___torch_mangle_57.Linear = prim::GetAttr[name="w_2"](%375)
  %377 : __torch__.torch.nn.modules.linear.___torch_mangle_56.Linear = prim::GetAttr[name="w_1"](%375)
  %378 : Tensor = prim::GetAttr[name="weight"](%377)
  %379 : Tensor = prim::GetAttr[name="bias"](%377)
  %380 : Tensor = aten::linear(%q.96, %378, %379) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %result.11 : Tensor = aten::relu(%380) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %382 : Tensor = prim::GetAttr[name="weight"](%376)
  %383 : Tensor = prim::GetAttr[name="bias"](%376)
  %x.31 : Tensor = aten::linear(%result.11, %382, %383) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %385 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%375)
  %386 : bool = prim::GetAttr[name="training"](%385)
  %x.32 : Tensor = aten::dropout(%x.31, %6, %386) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %x.33 : Tensor = aten::add_(%x.32, %q.96, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:80:8
  %389 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%375)
  %390 : Tensor = prim::GetAttr[name="weight"](%389)
  %391 : Tensor = prim::GetAttr[name="bias"](%389)
  %enc_output.18 : Tensor = aten::layer_norm(%x.33, %1474, %390, %391, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %397 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.MultiHeadAttention = prim::GetAttr[name="slf_attn"](%63)
  %d_k.14 : int = prim::GetAttr[name="d_k"](%397)
  %d_v.14 : int = prim::GetAttr[name="d_v"](%397)
  %n_head.14 : int = prim::GetAttr[name="n_head"](%397)
  %sz_b.14 : int = aten::size(%enc_output.18, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:36
  %len_q.14 : int = aten::size(%enc_output.18, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:47
  %405 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_qs"](%397)
  %406 : Tensor = prim::GetAttr[name="weight"](%405)
  %407 : Tensor = aten::linear(%enc_output.18, %406, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %408 : int[] = prim::ListConstruct(%sz_b.14, %len_q.14, %n_head.14, %d_k.14)
  %q.97 : Tensor = aten::view(%407, %408) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:41:12
  %410 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_ks"](%397)
  %411 : Tensor = prim::GetAttr[name="weight"](%410)
  %412 : Tensor = aten::linear(%enc_output.18, %411, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %k.30 : Tensor = aten::view(%412, %408) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:42:12
  %415 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_vs"](%397)
  %416 : Tensor = prim::GetAttr[name="weight"](%415)
  %417 : Tensor = aten::linear(%enc_output.18, %416, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %418 : int[] = prim::ListConstruct(%sz_b.14, %len_q.14, %n_head.14, %d_v.14)
  %v.30 : Tensor = aten::view(%417, %418) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:43:12
  %q.98 : Tensor = aten::transpose(%q.97, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:18
  %k.31 : Tensor = aten::transpose(%k.30, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:37
  %v.31 : Tensor = aten::transpose(%v.30, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:46:56
  %424 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.Modules.ScaledDotProductAttention = prim::GetAttr[name="attention"](%397)
  %425 : float = prim::GetAttr[name="temperature"](%424)
  %426 : Tensor = aten::div(%q.98, %425) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:28
  %427 : Tensor = aten::transpose(%k.31, %17, %10) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:50
  %attn.65 : Tensor = aten::matmul(%426, %427) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:18:15
  %attn.67 : Tensor = aten::masked_fill(%attn.65, %97, %11) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:21:19
  %431 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%424)
  %ret.14 : Tensor = aten::softmax(%attn.67, %18, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1583:14
  %433 : bool = prim::GetAttr[name="training"](%431)
  %attn.68 : Tensor = aten::dropout(%ret.14, %6, %433) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %output.14 : Tensor = aten::matmul(%attn.68, %v.31) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/Modules.py:24:17
  %439 : Tensor = aten::transpose(%output.14, %15, %17) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %440 : Tensor = aten::contiguous(%439, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %441 : int[] = prim::ListConstruct(%sz_b.14, %len_q.14, %18)
  %q.100 : Tensor = aten::view(%440, %441) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:55:12
  %443 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%397)
  %444 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="fc"](%397)
  %445 : Tensor = prim::GetAttr[name="weight"](%444)
  %446 : Tensor = aten::linear(%q.100, %445, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %447 : bool = prim::GetAttr[name="training"](%443)
  %q.101 : Tensor = aten::dropout(%446, %6, %447) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %q.102 : Tensor = aten::add_(%q.101, %enc_output.18, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:57:8
  %450 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%397)
  %451 : Tensor = prim::GetAttr[name="weight"](%450)
  %452 : Tensor = prim::GetAttr[name="bias"](%450)
  %q.103 : Tensor = aten::layer_norm(%q.102, %1474, %451, %452, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %458 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.PositionwiseFeedForward = prim::GetAttr[name="pos_ffn"](%63)
  %459 : __torch__.torch.nn.modules.linear.___torch_mangle_57.Linear = prim::GetAttr[name="w_2"](%458)
  %460 : __torch__.torch.nn.modules.linear.___torch_mangle_56.Linear = prim::GetAttr[name="w_1"](%458)
  %461 : Tensor = prim::GetAttr[name="weight"](%460)
  %462 : Tensor = prim::GetAttr[name="bias"](%460)
  %463 : Tensor = aten::linear(%q.103, %461, %462) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %result.12 : Tensor = aten::relu(%463) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %465 : Tensor = prim::GetAttr[name="weight"](%459)
  %466 : Tensor = prim::GetAttr[name="bias"](%459)
  %x.34 : Tensor = aten::linear(%result.12, %465, %466) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %468 : __torch__.torch.nn.modules.dropout.Dropout = prim::GetAttr[name="dropout"](%458)
  %469 : bool = prim::GetAttr[name="training"](%468)
  %x.35 : Tensor = aten::dropout(%x.34, %6, %469) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %x.36 : Tensor = aten::add_(%x.35, %q.103, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:80:8
  %472 : __torch__.torch.nn.modules.normalization.LayerNorm = prim::GetAttr[name="layer_norm"](%458)
  %473 : Tensor = prim::GetAttr[name="weight"](%472)
  %474 : Tensor = prim::GetAttr[name="bias"](%472)
  %enc_output.20 : Tensor = aten::layer_norm(%x.36, %1474, %473, %474, %9, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2202:11
  %480 : __torch__.torchbenchmark.models.attention_is_all_you_need_pytorch.transformer.SubLayers.MultiHeadAttention = prim::GetAttr[name="slf_attn"](%64)
  %d_k.18 : int = prim::GetAttr[name="d_k"](%480)
  %d_v.18 : int = prim::GetAttr[name="d_v"](%480)
  %n_head.18 : int = prim::GetAttr[name="n_head"](%480)
  %sz_b.18 : int = aten::size(%enc_output.20, %4) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:36
  %len_q.18 : int = aten::size(%enc_output.20, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/attention_is_all_you_need_pytorch/transformer/SubLayers.py:35:47
  %488 : __torch__.torch.nn.modules.linear.___torch_mangle_55.Linear = prim::GetAttr[name="w_qs"](%480)
  %489 : Tensor = prim::GetAttr[name="weight"](%488)
  %490 : Tensor = aten::linear(%enc_output.20, %489, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %491 : int[] = prim::ListConstruct(%sz_b.18, %len_q.18, %n_head.18, %d_k.18)
