graph(%self : __torch__.torchbenchmark.models.LearningToPaint.baseline.Renderer.model.FCN,
      %x.1 : Tensor):
  %101 : int[] = prim::Constant[value=[-1, 128, 128]]()
  %83 : int[] = prim::Constant[value=[1, 1]]()
  %82 : int[] = prim::Constant[value=[-1, 16, 16, 16]]()
  %5 : int = prim::Constant[value=1]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/LearningToPaint/baseline/Renderer/model.py:26:20
  %2 : int = prim::Constant[value=2]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/pixelshuffle.py:53:38
  %7 : __torch__.torch.nn.modules.linear.___torch_mangle_3.Linear = prim::GetAttr[name="fc1"](%self)
  %8 : Tensor = prim::GetAttr[name="weight"](%7)
  %9 : Tensor = prim::GetAttr[name="bias"](%7)
  %10 : Tensor = aten::linear(%x.1, %8, %9) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %result.4 : Tensor = aten::relu(%10) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %12 : __torch__.torch.nn.modules.linear.___torch_mangle_4.Linear = prim::GetAttr[name="fc2"](%self)
  %13 : Tensor = prim::GetAttr[name="weight"](%12)
  %14 : Tensor = prim::GetAttr[name="bias"](%12)
  %15 : Tensor = aten::linear(%result.4, %13, %14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %result.6 : Tensor = aten::relu(%15) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %17 : __torch__.torch.nn.modules.linear.___torch_mangle_5.Linear = prim::GetAttr[name="fc3"](%self)
  %18 : Tensor = prim::GetAttr[name="weight"](%17)
  %19 : Tensor = prim::GetAttr[name="bias"](%17)
  %20 : Tensor = aten::linear(%result.6, %18, %19) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %result.8 : Tensor = aten::relu(%20) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %22 : __torch__.torch.nn.modules.linear.___torch_mangle_6.Linear = prim::GetAttr[name="fc4"](%self)
  %23 : Tensor = prim::GetAttr[name="weight"](%22)
  %24 : Tensor = prim::GetAttr[name="bias"](%22)
  %25 : Tensor = aten::linear(%result.8, %23, %24) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %result.10 : Tensor = aten::relu(%25) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %x.11 : Tensor = aten::view(%result.10, %82) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/LearningToPaint/baseline/Renderer/model.py:26:12
  %29 : __torch__.torch.nn.modules.conv.Conv2d = prim::GetAttr[name="conv1"](%self)
  %30 : Tensor = prim::GetAttr[name="weight"](%29)
  %31 : Tensor? = prim::GetAttr[name="bias"](%29)
  %35 : Tensor = aten::conv2d(%x.11, %30, %31, %83, %83, %83, %5) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.12 : Tensor = aten::relu(%35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %37 : __torch__.torch.nn.modules.conv.___torch_mangle_7.Conv2d = prim::GetAttr[name="conv2"](%self)
  %38 : Tensor = prim::GetAttr[name="weight"](%37)
  %39 : Tensor? = prim::GetAttr[name="bias"](%37)
  %43 : Tensor = aten::conv2d(%result.12, %38, %39, %83, %83, %83, %5) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %x.15 : Tensor = aten::pixel_shuffle(%43, %2) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/pixelshuffle.py:53:15
  %45 : __torch__.torch.nn.modules.conv.___torch_mangle_8.Conv2d = prim::GetAttr[name="conv3"](%self)
  %46 : Tensor = prim::GetAttr[name="weight"](%45)
  %47 : Tensor? = prim::GetAttr[name="bias"](%45)
  %51 : Tensor = aten::conv2d(%x.15, %46, %47, %83, %83, %83, %5) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.14 : Tensor = aten::relu(%51) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %53 : __torch__.torch.nn.modules.conv.___torch_mangle_9.Conv2d = prim::GetAttr[name="conv4"](%self)
  %54 : Tensor = prim::GetAttr[name="weight"](%53)
  %55 : Tensor? = prim::GetAttr[name="bias"](%53)
  %59 : Tensor = aten::conv2d(%result.14, %54, %55, %83, %83, %83, %5) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %x.19 : Tensor = aten::pixel_shuffle(%59, %2) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/pixelshuffle.py:53:15
  %61 : __torch__.torch.nn.modules.conv.___torch_mangle_10.Conv2d = prim::GetAttr[name="conv5"](%self)
  %62 : Tensor = prim::GetAttr[name="weight"](%61)
  %63 : Tensor? = prim::GetAttr[name="bias"](%61)
  %67 : Tensor = aten::conv2d(%x.19, %62, %63, %83, %83, %83, %5) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.2 : Tensor = aten::relu(%67) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1206:17
  %69 : __torch__.torch.nn.modules.conv.___torch_mangle_11.Conv2d = prim::GetAttr[name="conv6"](%self)
  %70 : Tensor = prim::GetAttr[name="weight"](%69)
  %71 : Tensor? = prim::GetAttr[name="bias"](%69)
  %75 : Tensor = aten::conv2d(%result.2, %70, %71, %83, %83, %83, %5) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %x.23 : Tensor = aten::pixel_shuffle(%75, %2) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/pixelshuffle.py:53:15
  %x.25 : Tensor = aten::sigmoid(%x.23) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/LearningToPaint/baseline/Renderer/model.py:33:12
  %79 : Tensor = aten::view(%x.25, %101) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/LearningToPaint/baseline/Renderer/model.py:34:19
  %80 : Tensor = aten::neg(%79) # <string>:19:9
  %81 : Tensor = aten::add(%80, %5, %5) # <string>:19:9
  return (%81)

