graph(%self : __torch__.torchbenchmark.models.Super_SloMo.model_wrapper.Model,
      %trainFrameIndex.1 : Tensor,
      %I0.1 : Tensor,
      %I1.1 : Tensor,
      %IFrame.1 : Tensor):
  %1485 : int[] = prim::Constant[value=[3, 0, 1, 2]]()
  %1484 : Float(7, strides=[1], requires_grad=0, device=cpu) = prim::Constant[value= 0.1250  0.2500  0.3750  0.5000  0.6250  0.7500  0.8750 [ CPUFloatType{7} ]]()
  %1396 : int[] = prim::Constant[value=[2, 2]]()
  %1391 : int[] = prim::Constant[value=[3, 3]]()
  %1390 : int[] = prim::Constant[value=[1, 1]]()
  %38 : None = prim::Constant()
  %37 : int = prim::Constant[value=-1]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:70:63
  %36 : int = prim::Constant[value=9223372036854775807]()
  %35 : int = prim::Constant[value=1]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:28:56
  %34 : int = prim::Constant[value=2]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:31:27
  %33 : int = prim::Constant[value=0]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:37:23
  %32 : int = prim::Constant[value=3]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:38:43
  %31 : int = prim::Constant[value=4]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:49:32
  %30 : int = prim::Constant[value=5]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:50:42
  %29 : int = prim::Constant[value=204]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:77:15
  %28 : int = prim::Constant[value=102]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:77:32
  %27 : float = prim::Constant[value=0.0050000000000000001]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:77:49
  %26 : str = prim::Constant[value="bilinear"]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:130:51
  %25 : float = prim::Constant[value=2.]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:130:42
  %22 : str = prim::Constant[value="Default upsampling behavior when mode={} is changed to align_corners=False since 0.4.0. Please specify align_corners=True if the old behavior is desired. See the documentation of nn.Upsample for details."]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3452:16
  %20 : str = prim::Constant[value="The default behavior for interpolate/upsample with float scale_factor changed in 1.6.0 to align with other frameworks/libraries, and now uses scale_factor directly, instead of relying on the computed output size. If you wish to restore the old behavior, please set recompute_scale_factor=True. See the documentation of nn.Upsample for details. "]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3500:24
  %19 : str = prim::Constant[value="Got 3D input, but bilinear mode needs 4D input"]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3560:34
  %18 : str = prim::Constant[value="Got 5D input, but bilinear mode needs 4D input"]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3570:34
  %17 : str = prim::Constant[value="Input Error: Only 3D, 4D and 5D input Tensors supported (got {}D) for the modes: nearest | linear | bilinear | bicubic | trilinear (got {})"]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3573:8
  %16 : bool = prim::Constant[value=1]()
  %15 : bool = prim::Constant[value=0]()
  %14 : int[] = prim::Constant[value=[0, 0]]()
  %13 : int[] = prim::Constant[value=annotate(List[int], [])]()
  %12 : float = prim::Constant[value=0.10000000000000001]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:197:58
  %8 : str = prim::Constant[value="Default grid_sample and affine_grid behavior has changed to align_corners=False since 1.3.0. Please specify align_corners=True if the old behavior is desired. See the documentation of grid_sample for details."]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3826:12
  %7 : float = prim::Constant[value=0.5]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:279:26
  %6 : int = prim::Constant[value=6]() # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:276:12
  %5 : str = prim::Constant[value="nn.functional.sigmoid is deprecated. Use torch.sigmoid instead."]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1709:18
  %39 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.UNet = prim::GetAttr[name="flowComp"](%self)
  %40 : Tensor[] = prim::ListConstruct(%I0.1, %I1.1)
  %41 : Tensor = aten::cat(%40, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:28:32
  %42 : __torch__.torch.nn.modules.conv.___torch_mangle_12.Conv2d = prim::GetAttr[name="conv1"](%39)
  %43 : Tensor = prim::GetAttr[name="weight"](%42)
  %44 : Tensor? = prim::GetAttr[name="bias"](%42)
  %48 : Tensor = aten::conv2d(%41, %43, %44, %1390, %1391, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.16 : Tensor = aten::leaky_relu(%48, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %50 : __torch__.torch.nn.modules.conv.___torch_mangle_13.Conv2d = prim::GetAttr[name="conv2"](%39)
  %51 : Tensor = prim::GetAttr[name="weight"](%50)
  %52 : Tensor? = prim::GetAttr[name="bias"](%50)
  %56 : Tensor = aten::conv2d(%result.16, %51, %52, %1390, %1391, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.17 : Tensor = aten::leaky_relu(%56, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %58 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.down = prim::GetAttr[name="down1"](%39)
  %x.16 : Tensor = aten::avg_pool2d(%result.17, %1396, %13, %14, %15, %16, %38) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:67:12
  %61 : __torch__.torch.nn.modules.conv.___torch_mangle_14.Conv2d = prim::GetAttr[name="conv1"](%58)
  %62 : Tensor = prim::GetAttr[name="weight"](%61)
  %63 : Tensor? = prim::GetAttr[name="bias"](%61)
  %67 : Tensor = aten::conv2d(%x.16, %62, %63, %1390, %1396, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.18 : Tensor = aten::leaky_relu(%67, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %69 : __torch__.torch.nn.modules.conv.___torch_mangle_15.Conv2d = prim::GetAttr[name="conv2"](%58)
  %70 : Tensor = prim::GetAttr[name="weight"](%69)
  %71 : Tensor? = prim::GetAttr[name="bias"](%69)
  %75 : Tensor = aten::conv2d(%result.18, %70, %71, %1390, %1396, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %s2.2 : Tensor = aten::leaky_relu(%75, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %77 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.___torch_mangle_18.down = prim::GetAttr[name="down2"](%39)
  %x.17 : Tensor = aten::avg_pool2d(%s2.2, %1396, %13, %14, %15, %16, %38) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:67:12
  %80 : __torch__.torch.nn.modules.conv.___torch_mangle_16.Conv2d = prim::GetAttr[name="conv1"](%77)
  %81 : Tensor = prim::GetAttr[name="weight"](%80)
  %82 : Tensor? = prim::GetAttr[name="bias"](%80)
  %86 : Tensor = aten::conv2d(%x.17, %81, %82, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.19 : Tensor = aten::leaky_relu(%86, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %88 : __torch__.torch.nn.modules.conv.___torch_mangle_17.Conv2d = prim::GetAttr[name="conv2"](%77)
  %89 : Tensor = prim::GetAttr[name="weight"](%88)
  %90 : Tensor? = prim::GetAttr[name="bias"](%88)
  %94 : Tensor = aten::conv2d(%result.19, %89, %90, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %s3.2 : Tensor = aten::leaky_relu(%94, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %96 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.___torch_mangle_21.down = prim::GetAttr[name="down3"](%39)
  %x.18 : Tensor = aten::avg_pool2d(%s3.2, %1396, %13, %14, %15, %16, %38) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:67:12
  %99 : __torch__.torch.nn.modules.conv.___torch_mangle_19.Conv2d = prim::GetAttr[name="conv1"](%96)
  %100 : Tensor = prim::GetAttr[name="weight"](%99)
  %101 : Tensor? = prim::GetAttr[name="bias"](%99)
  %105 : Tensor = aten::conv2d(%x.18, %100, %101, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.20 : Tensor = aten::leaky_relu(%105, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %107 : __torch__.torch.nn.modules.conv.___torch_mangle_20.Conv2d = prim::GetAttr[name="conv2"](%96)
  %108 : Tensor = prim::GetAttr[name="weight"](%107)
  %109 : Tensor? = prim::GetAttr[name="bias"](%107)
  %113 : Tensor = aten::conv2d(%result.20, %108, %109, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %s4.2 : Tensor = aten::leaky_relu(%113, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %115 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.___torch_mangle_24.down = prim::GetAttr[name="down4"](%39)
  %x.19 : Tensor = aten::avg_pool2d(%s4.2, %1396, %13, %14, %15, %16, %38) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:67:12
  %118 : __torch__.torch.nn.modules.conv.___torch_mangle_22.Conv2d = prim::GetAttr[name="conv1"](%115)
  %119 : Tensor = prim::GetAttr[name="weight"](%118)
  %120 : Tensor? = prim::GetAttr[name="bias"](%118)
  %124 : Tensor = aten::conv2d(%x.19, %119, %120, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.21 : Tensor = aten::leaky_relu(%124, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %126 : __torch__.torch.nn.modules.conv.___torch_mangle_23.Conv2d = prim::GetAttr[name="conv2"](%115)
  %127 : Tensor = prim::GetAttr[name="weight"](%126)
  %128 : Tensor? = prim::GetAttr[name="bias"](%126)
  %132 : Tensor = aten::conv2d(%result.21, %127, %128, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %s5.2 : Tensor = aten::leaky_relu(%132, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %134 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.___torch_mangle_25.down = prim::GetAttr[name="down5"](%39)
  %x.4 : Tensor = aten::avg_pool2d(%s5.2, %1396, %13, %14, %15, %16, %38) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:67:12
  %137 : __torch__.torch.nn.modules.conv.___torch_mangle_23.Conv2d = prim::GetAttr[name="conv1"](%134)
  %138 : Tensor = prim::GetAttr[name="weight"](%137)
  %139 : Tensor? = prim::GetAttr[name="bias"](%137)
  %143 : Tensor = aten::conv2d(%x.4, %138, %139, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.22 : Tensor = aten::leaky_relu(%143, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %145 : __torch__.torch.nn.modules.conv.___torch_mangle_23.Conv2d = prim::GetAttr[name="conv2"](%134)
  %146 : Tensor = prim::GetAttr[name="weight"](%145)
  %147 : Tensor? = prim::GetAttr[name="bias"](%145)
  %151 : Tensor = aten::conv2d(%result.22, %146, %147, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %x.21 : Tensor = aten::leaky_relu(%151, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %153 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.up = prim::GetAttr[name="up1"](%39)
  %154 : Tensor = prim::Uninitialized()
  %159 : str = aten::format(%22, %26) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3452:16
   = aten::warn[warn_id=5](%159, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3451:12
  %160 : int = aten::dim(%x.21) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %dim.6 : int = aten::sub(%160, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %scale_factors.7 : float[] = prim::ListConstruct()
   = prim::Loop(%dim.6, %16) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
    block0(%163 : int):
      %164 : float[] = aten::append(%scale_factors.7, %25) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
      -> (%16)
  %165 : int = aten::len(%scale_factors.7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
  %166 : bool = aten::gt(%165, %33)
  %167 : int = prim::Loop(%36, %166, %33) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
    block0(%168 : int, %169 : int):
      %scale.6 : float = aten::__getitem__(%scale_factors.7, %169) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
      %171 : int = aten::floor(%scale.6) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %172 : bool = aten::ne(%171, %scale.6) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %173 : bool = prim::If(%172) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:16
        block0():
           = aten::warn[warn_id=6](%20, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3499:20
          -> (%15)
        block1():
          -> (%16)
      %174 : int = aten::add(%169, %35)
      %175 : bool = aten::lt(%174, %165)
      %176 : bool = aten::__and__(%175, %173)
      -> (%176, %174)
  %178 : bool = aten::eq(%160, %31) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:7
  %179 : Tensor = prim::If(%178) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:4
    block0():
      %183 : Tensor = aten::upsample_bilinear2d(%x.21, %38, %15, %scale_factors.7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3551:15
      -> (%183)
    block1():
      %185 : bool = aten::eq(%160, %32) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:7
       = prim::If(%185) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:4
        block0():
           = prim::RaiseException(%19) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3560:8
          -> ()
        block1():
          -> ()
      %187 : bool = aten::eq(%160, %30) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:7
       = prim::If(%187) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:4
        block0():
           = prim::RaiseException(%18) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3570:8
          -> ()
        block1():
          -> ()
      %189 : str = aten::format(%17, %160, %26) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3573:8
       = prim::RaiseException(%189) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3572:4
      -> (%154)
  %190 : __torch__.torch.nn.modules.conv.___torch_mangle_23.Conv2d = prim::GetAttr[name="conv1"](%153)
  %191 : Tensor = prim::GetAttr[name="weight"](%190)
  %192 : Tensor? = prim::GetAttr[name="bias"](%190)
  %196 : Tensor = aten::conv2d(%179, %191, %192, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.23 : Tensor = aten::leaky_relu(%196, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %198 : __torch__.torch.nn.modules.conv.___torch_mangle_26.Conv2d = prim::GetAttr[name="conv2"](%153)
  %199 : Tensor[] = prim::ListConstruct(%result.23, %s5.2)
  %200 : Tensor = aten::cat(%199, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:134:36
  %201 : Tensor = prim::GetAttr[name="weight"](%198)
  %202 : Tensor? = prim::GetAttr[name="bias"](%198)
  %206 : Tensor = aten::conv2d(%200, %201, %202, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %x.22 : Tensor = aten::leaky_relu(%206, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %208 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.___torch_mangle_28.up = prim::GetAttr[name="up2"](%39)
   = aten::warn[warn_id=5](%159, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3451:12
  %215 : int = aten::dim(%x.22) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %dim.7 : int = aten::sub(%215, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %scale_factors.8 : float[] = prim::ListConstruct()
   = prim::Loop(%dim.7, %16) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
    block0(%218 : int):
      %219 : float[] = aten::append(%scale_factors.8, %25) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
      -> (%16)
  %220 : int = aten::len(%scale_factors.8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
  %221 : bool = aten::gt(%220, %33)
  %222 : int = prim::Loop(%36, %221, %33) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
    block0(%223 : int, %224 : int):
      %scale.7 : float = aten::__getitem__(%scale_factors.8, %224) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
      %226 : int = aten::floor(%scale.7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %227 : bool = aten::ne(%226, %scale.7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %228 : bool = prim::If(%227) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:16
        block0():
           = aten::warn[warn_id=6](%20, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3499:20
          -> (%15)
        block1():
          -> (%16)
      %229 : int = aten::add(%224, %35)
      %230 : bool = aten::lt(%229, %220)
      %231 : bool = aten::__and__(%230, %228)
      -> (%231, %229)
  %233 : bool = aten::eq(%215, %31) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:7
  %234 : Tensor = prim::If(%233) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:4
    block0():
      %238 : Tensor = aten::upsample_bilinear2d(%x.22, %38, %15, %scale_factors.8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3551:15
      -> (%238)
    block1():
      %240 : bool = aten::eq(%215, %32) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:7
       = prim::If(%240) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:4
        block0():
           = prim::RaiseException(%19) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3560:8
          -> ()
        block1():
          -> ()
      %242 : bool = aten::eq(%215, %30) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:7
       = prim::If(%242) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:4
        block0():
           = prim::RaiseException(%18) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3570:8
          -> ()
        block1():
          -> ()
      %244 : str = aten::format(%17, %215, %26) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3573:8
       = prim::RaiseException(%244) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3572:4
      -> (%154)
  %245 : __torch__.torch.nn.modules.conv.___torch_mangle_27.Conv2d = prim::GetAttr[name="conv1"](%208)
  %246 : Tensor = prim::GetAttr[name="weight"](%245)
  %247 : Tensor? = prim::GetAttr[name="bias"](%245)
  %251 : Tensor = aten::conv2d(%234, %246, %247, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.24 : Tensor = aten::leaky_relu(%251, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %253 : __torch__.torch.nn.modules.conv.___torch_mangle_27.Conv2d = prim::GetAttr[name="conv2"](%208)
  %254 : Tensor[] = prim::ListConstruct(%result.24, %s4.2)
  %255 : Tensor = aten::cat(%254, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:134:36
  %256 : Tensor = prim::GetAttr[name="weight"](%253)
  %257 : Tensor? = prim::GetAttr[name="bias"](%253)
  %261 : Tensor = aten::conv2d(%255, %256, %257, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %x.23 : Tensor = aten::leaky_relu(%261, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %263 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.___torch_mangle_30.up = prim::GetAttr[name="up3"](%39)
   = aten::warn[warn_id=5](%159, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3451:12
  %270 : int = aten::dim(%x.23) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %dim.8 : int = aten::sub(%270, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %scale_factors.9 : float[] = prim::ListConstruct()
   = prim::Loop(%dim.8, %16) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
    block0(%273 : int):
      %274 : float[] = aten::append(%scale_factors.9, %25) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
      -> (%16)
  %275 : int = aten::len(%scale_factors.9) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
  %276 : bool = aten::gt(%275, %33)
  %277 : int = prim::Loop(%36, %276, %33) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
    block0(%278 : int, %279 : int):
      %scale.8 : float = aten::__getitem__(%scale_factors.9, %279) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
      %281 : int = aten::floor(%scale.8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %282 : bool = aten::ne(%281, %scale.8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %283 : bool = prim::If(%282) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:16
        block0():
           = aten::warn[warn_id=6](%20, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3499:20
          -> (%15)
        block1():
          -> (%16)
      %284 : int = aten::add(%279, %35)
      %285 : bool = aten::lt(%284, %275)
      %286 : bool = aten::__and__(%285, %283)
      -> (%286, %284)
  %288 : bool = aten::eq(%270, %31) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:7
  %289 : Tensor = prim::If(%288) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:4
    block0():
      %293 : Tensor = aten::upsample_bilinear2d(%x.23, %38, %15, %scale_factors.9) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3551:15
      -> (%293)
    block1():
      %295 : bool = aten::eq(%270, %32) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:7
       = prim::If(%295) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:4
        block0():
           = prim::RaiseException(%19) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3560:8
          -> ()
        block1():
          -> ()
      %297 : bool = aten::eq(%270, %30) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:7
       = prim::If(%297) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:4
        block0():
           = prim::RaiseException(%18) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3570:8
          -> ()
        block1():
          -> ()
      %299 : str = aten::format(%17, %270, %26) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3573:8
       = prim::RaiseException(%299) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3572:4
      -> (%154)
  %300 : __torch__.torch.nn.modules.conv.___torch_mangle_29.Conv2d = prim::GetAttr[name="conv1"](%263)
  %301 : Tensor = prim::GetAttr[name="weight"](%300)
  %302 : Tensor? = prim::GetAttr[name="bias"](%300)
  %306 : Tensor = aten::conv2d(%289, %301, %302, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.25 : Tensor = aten::leaky_relu(%306, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %308 : __torch__.torch.nn.modules.conv.___torch_mangle_29.Conv2d = prim::GetAttr[name="conv2"](%263)
  %309 : Tensor[] = prim::ListConstruct(%result.25, %s3.2)
  %310 : Tensor = aten::cat(%309, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:134:36
  %311 : Tensor = prim::GetAttr[name="weight"](%308)
  %312 : Tensor? = prim::GetAttr[name="bias"](%308)
  %316 : Tensor = aten::conv2d(%310, %311, %312, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %x.24 : Tensor = aten::leaky_relu(%316, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %318 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.___torch_mangle_32.up = prim::GetAttr[name="up4"](%39)
   = aten::warn[warn_id=5](%159, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3451:12
  %325 : int = aten::dim(%x.24) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %dim.9 : int = aten::sub(%325, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %scale_factors.10 : float[] = prim::ListConstruct()
   = prim::Loop(%dim.9, %16) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
    block0(%328 : int):
      %329 : float[] = aten::append(%scale_factors.10, %25) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
      -> (%16)
  %330 : int = aten::len(%scale_factors.10) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
  %331 : bool = aten::gt(%330, %33)
  %332 : int = prim::Loop(%36, %331, %33) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
    block0(%333 : int, %334 : int):
      %scale.9 : float = aten::__getitem__(%scale_factors.10, %334) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
      %336 : int = aten::floor(%scale.9) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %337 : bool = aten::ne(%336, %scale.9) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %338 : bool = prim::If(%337) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:16
        block0():
           = aten::warn[warn_id=6](%20, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3499:20
          -> (%15)
        block1():
          -> (%16)
      %339 : int = aten::add(%334, %35)
      %340 : bool = aten::lt(%339, %330)
      %341 : bool = aten::__and__(%340, %338)
      -> (%341, %339)
  %343 : bool = aten::eq(%325, %31) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:7
  %344 : Tensor = prim::If(%343) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:4
    block0():
      %348 : Tensor = aten::upsample_bilinear2d(%x.24, %38, %15, %scale_factors.10) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3551:15
      -> (%348)
    block1():
      %350 : bool = aten::eq(%325, %32) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:7
       = prim::If(%350) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:4
        block0():
           = prim::RaiseException(%19) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3560:8
          -> ()
        block1():
          -> ()
      %352 : bool = aten::eq(%325, %30) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:7
       = prim::If(%352) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:4
        block0():
           = prim::RaiseException(%18) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3570:8
          -> ()
        block1():
          -> ()
      %354 : str = aten::format(%17, %325, %26) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3573:8
       = prim::RaiseException(%354) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3572:4
      -> (%154)
  %355 : __torch__.torch.nn.modules.conv.___torch_mangle_31.Conv2d = prim::GetAttr[name="conv1"](%318)
  %356 : Tensor = prim::GetAttr[name="weight"](%355)
  %357 : Tensor? = prim::GetAttr[name="bias"](%355)
  %361 : Tensor = aten::conv2d(%344, %356, %357, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.26 : Tensor = aten::leaky_relu(%361, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %363 : __torch__.torch.nn.modules.conv.___torch_mangle_31.Conv2d = prim::GetAttr[name="conv2"](%318)
  %364 : Tensor[] = prim::ListConstruct(%result.26, %s2.2)
  %365 : Tensor = aten::cat(%364, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:134:36
  %366 : Tensor = prim::GetAttr[name="weight"](%363)
  %367 : Tensor? = prim::GetAttr[name="bias"](%363)
  %371 : Tensor = aten::conv2d(%365, %366, %367, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %x.25 : Tensor = aten::leaky_relu(%371, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %373 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.___torch_mangle_34.up = prim::GetAttr[name="up5"](%39)
   = aten::warn[warn_id=5](%159, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3451:12
  %380 : int = aten::dim(%x.25) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %dim.10 : int = aten::sub(%380, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3459:10
  %scale_factors.11 : float[] = prim::ListConstruct()
   = prim::Loop(%dim.10, %16) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
    block0(%383 : int):
      %384 : float[] = aten::append(%scale_factors.11, %25) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3489:28
      -> (%16)
  %385 : int = aten::len(%scale_factors.11) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
  %386 : bool = aten::gt(%385, %33)
  %387 : int = prim::Loop(%36, %386, %33) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
    block0(%388 : int, %389 : int):
      %scale.10 : float = aten::__getitem__(%scale_factors.11, %389) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3497:12
      %391 : int = aten::floor(%scale.10) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %392 : bool = aten::ne(%391, %scale.10) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:19
      %393 : bool = prim::If(%392) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3498:16
        block0():
           = aten::warn[warn_id=6](%20, %34) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3499:20
          -> (%15)
        block1():
          -> (%16)
      %394 : int = aten::add(%389, %35)
      %395 : bool = aten::lt(%394, %385)
      %396 : bool = aten::__and__(%395, %393)
      -> (%396, %394)
  %398 : bool = aten::eq(%380, %31) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:7
  %399 : Tensor = prim::If(%398) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3549:4
    block0():
      %403 : Tensor = aten::upsample_bilinear2d(%x.25, %38, %15, %scale_factors.11) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3551:15
      -> (%403)
    block1():
      %405 : bool = aten::eq(%380, %32) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:7
       = prim::If(%405) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3559:4
        block0():
           = prim::RaiseException(%19) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3560:8
          -> ()
        block1():
          -> ()
      %407 : bool = aten::eq(%380, %30) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:7
       = prim::If(%407) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3569:4
        block0():
           = prim::RaiseException(%18) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3570:8
          -> ()
        block1():
          -> ()
      %409 : str = aten::format(%17, %380, %26) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3573:8
       = prim::RaiseException(%409) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3572:4
      -> (%154)
  %410 : __torch__.torch.nn.modules.conv.___torch_mangle_33.Conv2d = prim::GetAttr[name="conv1"](%373)
  %411 : Tensor = prim::GetAttr[name="weight"](%410)
  %412 : Tensor? = prim::GetAttr[name="bias"](%410)
  %416 : Tensor = aten::conv2d(%399, %411, %412, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %result.27 : Tensor = aten::leaky_relu(%416, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %418 : __torch__.torch.nn.modules.conv.___torch_mangle_33.Conv2d = prim::GetAttr[name="conv2"](%373)
  %419 : Tensor[] = prim::ListConstruct(%result.27, %result.17)
  %420 : Tensor = aten::cat(%419, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:134:36
  %421 : Tensor = prim::GetAttr[name="weight"](%418)
  %422 : Tensor? = prim::GetAttr[name="bias"](%418)
  %426 : Tensor = aten::conv2d(%420, %421, %422, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %x.26 : Tensor = aten::leaky_relu(%426, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %428 : __torch__.torch.nn.modules.conv.___torch_mangle_35.Conv2d = prim::GetAttr[name="conv3"](%39)
  %429 : Tensor = prim::GetAttr[name="weight"](%428)
  %430 : Tensor? = prim::GetAttr[name="bias"](%428)
  %434 : Tensor = aten::conv2d(%x.26, %429, %430, %1390, %1390, %1390, %35) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %flowOut.1 : Tensor = aten::leaky_relu(%434, %12) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1378:17
  %436 : Tensor = aten::slice(%flowOut.1, %33, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:31:16
  %437 : Tensor = aten::slice(%436, %35, %33, %34, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:31:16
  %438 : Tensor = aten::slice(%437, %34, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:31:16
  %F_0_1.1 : Tensor = aten::slice(%438, %32, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:31:16
  %441 : Tensor = aten::slice(%436, %35, %34, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:32:16
  %442 : Tensor = aten::slice(%441, %34, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:32:16
  %F_1_0.1 : Tensor = aten::slice(%442, %32, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:32:16
  %444 : Device = prim::device(%I0.1)
  %446 : Tensor?[] = prim::ListConstruct(%trainFrameIndex.1)
  %447 : Tensor = aten::index(%1484, %446) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:324:24
  %448 : Tensor = aten::neg(%447) # <string>:19:9
  %449 : Tensor = aten::add(%448, %35, %35) # <string>:19:9
  %450 : Tensor = aten::neg(%449) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:324:16
  %451 : Tensor?[] = prim::ListConstruct(%trainFrameIndex.1)
  %452 : Tensor = aten::index(%1484, %451) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:324:36
  %453 : Tensor = aten::mul(%450, %452) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:324:16
  %454 : Tensor?[] = prim::ListConstruct(%trainFrameIndex.1)
  %455 : Tensor = aten::index(%1484, %454) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:325:11
  %456 : Tensor?[] = prim::ListConstruct(%trainFrameIndex.1)
  %457 : Tensor = aten::index(%1484, %456) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:325:22
  %C01.1 : Tensor = aten::mul(%455, %457) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:325:11
  %459 : Tensor?[] = prim::ListConstruct(%trainFrameIndex.1)
  %460 : Tensor = aten::index(%1484, %459) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:326:16
  %461 : Tensor = aten::neg(%460) # <string>:19:9
  %462 : Tensor = aten::add(%461, %35, %35) # <string>:19:9
  %463 : Tensor?[] = prim::ListConstruct(%trainFrameIndex.1)
  %464 : Tensor = aten::index(%1484, %463) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:326:33
  %465 : Tensor = aten::neg(%464) # <string>:19:9
  %466 : Tensor = aten::add(%465, %35, %35) # <string>:19:9
  %C10.1 : Tensor = aten::mul(%462, %466) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:326:11
  %468 : Tensor = aten::unsqueeze(%453, %33) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:11
  %469 : Tensor = aten::unsqueeze(%468, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:11
  %470 : Tensor = aten::unsqueeze(%469, %34) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:11
  %471 : Tensor = aten::slice(%470, %32, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:11
  %473 : Tensor = aten::permute(%471, %1485) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:11
  %474 : Tensor = aten::to(%473, %444, %38, %15, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:11
  %475 : Tensor = aten::unsqueeze(%C01.1, %33) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:68
  %476 : Tensor = aten::unsqueeze(%475, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:68
  %477 : Tensor = aten::unsqueeze(%476, %34) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:68
  %478 : Tensor = aten::slice(%477, %32, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:68
  %480 : Tensor = aten::permute(%478, %1485) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:68
  %481 : Tensor = aten::to(%480, %444, %38, %15, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:68
  %482 : Tensor = aten::unsqueeze(%C10.1, %33) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:125
  %483 : Tensor = aten::unsqueeze(%482, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:125
  %484 : Tensor = aten::unsqueeze(%483, %34) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:125
  %485 : Tensor = aten::slice(%484, %32, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:125
  %487 : Tensor = aten::permute(%485, %1485) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:125
  %488 : Tensor = aten::to(%487, %444, %38, %15, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:125
  %489 : Tensor = aten::unsqueeze(%453, %33) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:182
  %490 : Tensor = aten::unsqueeze(%489, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:182
  %491 : Tensor = aten::unsqueeze(%490, %34) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:182
  %492 : Tensor = aten::slice(%491, %32, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:182
  %494 : Tensor = aten::permute(%492, %1485) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:182
  %495 : Tensor = aten::to(%494, %444, %38, %15, %15) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:327:182
  %498 : Tensor = aten::mul(%474, %F_0_1.1) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:37:16
  %500 : Tensor = aten::mul(%481, %F_1_0.1) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:37:36
  %F_t_0.1 : Tensor = aten::add(%498, %500, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:37:16
  %503 : Tensor = aten::mul(%488, %F_0_1.1) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:38:16
  %505 : Tensor = aten::mul(%495, %F_1_0.1) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:38:36
  %F_t_1.1 : Tensor = aten::add(%503, %505, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/model_wrapper.py:38:16
  %507 : __torch__.torchbenchmark.models.Super_SloMo.slomo_model.backWarp = prim::GetAttr[name="trainFlowBackWarp"](%self)
  %508 : Tensor = aten::slice(%F_t_0.1, %33, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:274:12
  %509 : Tensor = aten::select(%508, %35, %33) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:274:12
  %510 : Tensor = aten::slice(%509, %35, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:274:12
  %u.2 : Tensor = aten::slice(%510, %34, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:274:12
  %513 : Tensor = aten::select(%508, %35, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:275:12
  %514 : Tensor = aten::slice(%513, %35, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:275:12
  %v.2 : Tensor = aten::slice(%514, %34, %33, %36, %35) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:275:12
  %516 : Tensor = prim::GetAttr[name="gridX"](%507)
  %517 : Tensor = aten::unsqueeze(%516, %33) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:276:12
  %518 : Tensor = aten::expand_as(%517, %u.2) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:276:12
  %519 : Tensor = aten::to(%518, %6, %15, %15, %38) # /mnt/ssd1/pengwu/projects/torchbenchmark/torchbenchmark/models/Super_SloMo/slomo_model.py:276:12
