graph(%self : __torch__.torchvision.models.vgg.VGG,
      %x.1 : Tensor):
  %226 : int[] = prim::Constant[value=[7, 7]]()
  %175 : int[] = prim::Constant[value=[0, 0]]()
  %173 : int[] = prim::Constant[value=[2, 2]]()
  %167 : int[] = prim::Constant[value=[1, 1]]()
  %9 : int = prim::Constant[value=-1]()
  %8 : int = prim::Constant[value=1]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torchvision-0.9.0a0+767b23e-py3.8-linux-x86_64.egg/torchvision/models/vgg.py:51:29
  %7 : bool = prim::Constant[value=0]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/pooling.py:163:57
  %5 : int = prim::Constant[value=2]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/pooling.py:162:35
  %4 : str = prim::Constant[value="AssertionError: "]()
  %2 : float = prim::Constant[value=0.5]() # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/dropout.py:58:32
  %10 : __torch__.torch.nn.modules.container.___torch_mangle_550.Sequential = prim::GetAttr[name="features"](%self)
  %11 : __torch__.torch.nn.modules.conv.___torch_mangle_39.Conv2d = prim::GetAttr[name="0"](%10)
  %12 : __torch__.torch.nn.modules.conv.___torch_mangle_40.Conv2d = prim::GetAttr[name="2"](%10)
  %13 : __torch__.torch.nn.modules.conv.___torch_mangle_16.Conv2d = prim::GetAttr[name="5"](%10)
  %14 : __torch__.torch.nn.modules.conv.___torch_mangle_17.Conv2d = prim::GetAttr[name="7"](%10)
  %15 : __torch__.torch.nn.modules.conv.___torch_mangle_19.Conv2d = prim::GetAttr[name="10"](%10)
  %16 : __torch__.torch.nn.modules.conv.___torch_mangle_20.Conv2d = prim::GetAttr[name="12"](%10)
  %17 : __torch__.torch.nn.modules.conv.___torch_mangle_20.Conv2d = prim::GetAttr[name="14"](%10)
  %18 : __torch__.torch.nn.modules.conv.___torch_mangle_22.Conv2d = prim::GetAttr[name="17"](%10)
  %19 : __torch__.torch.nn.modules.conv.___torch_mangle_23.Conv2d = prim::GetAttr[name="19"](%10)
  %20 : __torch__.torch.nn.modules.conv.___torch_mangle_23.Conv2d = prim::GetAttr[name="21"](%10)
  %21 : __torch__.torch.nn.modules.conv.___torch_mangle_23.Conv2d = prim::GetAttr[name="24"](%10)
  %22 : __torch__.torch.nn.modules.conv.___torch_mangle_23.Conv2d = prim::GetAttr[name="26"](%10)
  %23 : __torch__.torch.nn.modules.conv.___torch_mangle_23.Conv2d = prim::GetAttr[name="28"](%10)
  %24 : Tensor = prim::GetAttr[name="weight"](%11)
  %25 : Tensor? = prim::GetAttr[name="bias"](%11)
  %input.4 : Tensor = aten::conv2d(%x.1, %24, %25, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.6 : Tensor = aten::relu_(%input.4) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %31 : Tensor = prim::GetAttr[name="weight"](%12)
  %32 : Tensor? = prim::GetAttr[name="bias"](%12)
  %input.8 : Tensor = aten::conv2d(%input.6, %31, %32, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.10 : Tensor = aten::relu_(%input.8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %input.12 : Tensor = aten::max_pool2d(%input.10, %173, %173, %175, %167, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:659:11
  %43 : Tensor = prim::GetAttr[name="weight"](%13)
  %44 : Tensor? = prim::GetAttr[name="bias"](%13)
  %input.14 : Tensor = aten::conv2d(%input.12, %43, %44, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.16 : Tensor = aten::relu_(%input.14) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %50 : Tensor = prim::GetAttr[name="weight"](%14)
  %51 : Tensor? = prim::GetAttr[name="bias"](%14)
  %input.17 : Tensor = aten::conv2d(%input.16, %50, %51, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.19 : Tensor = aten::relu_(%input.17) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %input.21 : Tensor = aten::max_pool2d(%input.19, %173, %173, %175, %167, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:659:11
  %62 : Tensor = prim::GetAttr[name="weight"](%15)
  %63 : Tensor? = prim::GetAttr[name="bias"](%15)
  %input.23 : Tensor = aten::conv2d(%input.21, %62, %63, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.25 : Tensor = aten::relu_(%input.23) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %69 : Tensor = prim::GetAttr[name="weight"](%16)
  %70 : Tensor? = prim::GetAttr[name="bias"](%16)
  %input.27 : Tensor = aten::conv2d(%input.25, %69, %70, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.29 : Tensor = aten::relu_(%input.27) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %76 : Tensor = prim::GetAttr[name="weight"](%17)
  %77 : Tensor? = prim::GetAttr[name="bias"](%17)
  %input.31 : Tensor = aten::conv2d(%input.29, %76, %77, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.33 : Tensor = aten::relu_(%input.31) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %input.35 : Tensor = aten::max_pool2d(%input.33, %173, %173, %175, %167, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:659:11
  %88 : Tensor = prim::GetAttr[name="weight"](%18)
  %89 : Tensor? = prim::GetAttr[name="bias"](%18)
  %input.37 : Tensor = aten::conv2d(%input.35, %88, %89, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.39 : Tensor = aten::relu_(%input.37) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %95 : Tensor = prim::GetAttr[name="weight"](%19)
  %96 : Tensor? = prim::GetAttr[name="bias"](%19)
  %input.41 : Tensor = aten::conv2d(%input.39, %95, %96, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.43 : Tensor = aten::relu_(%input.41) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %102 : Tensor = prim::GetAttr[name="weight"](%20)
  %103 : Tensor? = prim::GetAttr[name="bias"](%20)
  %input.45 : Tensor = aten::conv2d(%input.43, %102, %103, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.47 : Tensor = aten::relu_(%input.45) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %input.49 : Tensor = aten::max_pool2d(%input.47, %173, %173, %175, %167, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:659:11
  %114 : Tensor = prim::GetAttr[name="weight"](%21)
  %115 : Tensor? = prim::GetAttr[name="bias"](%21)
  %input.51 : Tensor = aten::conv2d(%input.49, %114, %115, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.53 : Tensor = aten::relu_(%input.51) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %121 : Tensor = prim::GetAttr[name="weight"](%22)
  %122 : Tensor? = prim::GetAttr[name="bias"](%22)
  %input.55 : Tensor = aten::conv2d(%input.53, %121, %122, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.57 : Tensor = aten::relu_(%input.55) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %128 : Tensor = prim::GetAttr[name="weight"](%23)
  %129 : Tensor? = prim::GetAttr[name="bias"](%23)
  %input.59 : Tensor = aten::conv2d(%input.57, %128, %129, %167, %167, %167, %8) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/modules/conv.py:395:15
  %input.61 : Tensor = aten::relu_(%input.59) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %x.3 : Tensor = aten::max_pool2d(%input.61, %173, %173, %175, %167, %7) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:659:11
  %141 : int[] = aten::size(%x.3) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1036:51
  %142 : int = aten::len(%141) # <string>:5:9
  %143 : bool = aten::gt(%142, %5) # <string>:5:9
   = prim::If(%143) # <string>:5:2
    block0():
      -> ()
    block1():
       = prim::RaiseException(%4) # <string>:5:2
      -> ()
  %x.5 : Tensor = aten::adaptive_avg_pool2d(%x.3, %226) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1037:11
  %x.7 : Tensor = aten::flatten(%x.5, %8, %9) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torchvision-0.9.0a0+767b23e-py3.8-linux-x86_64.egg/torchvision/models/vgg.py:51:12
  %146 : __torch__.torch.nn.modules.container.___torch_mangle_553.Sequential = prim::GetAttr[name="classifier"](%self)
  %147 : __torch__.torch.nn.modules.linear.___torch_mangle_552.Linear = prim::GetAttr[name="0"](%146)
  %148 : __torch__.torch.nn.modules.dropout.___torch_mangle_50.Dropout = prim::GetAttr[name="2"](%146)
  %149 : __torch__.torch.nn.modules.linear.___torch_mangle_52.Linear = prim::GetAttr[name="3"](%146)
  %150 : __torch__.torch.nn.modules.dropout.___torch_mangle_50.Dropout = prim::GetAttr[name="5"](%146)
  %151 : __torch__.torch.nn.modules.linear.___torch_mangle_53.Linear = prim::GetAttr[name="6"](%146)
  %152 : Tensor = prim::GetAttr[name="weight"](%147)
  %153 : Tensor = prim::GetAttr[name="bias"](%147)
  %input.3 : Tensor = aten::linear(%x.7, %152, %153) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %input.5 : Tensor = aten::relu_(%input.3) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %156 : bool = prim::GetAttr[name="training"](%148)
  %input.7 : Tensor = aten::dropout(%input.5, %2, %156) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %158 : Tensor = prim::GetAttr[name="weight"](%149)
  %159 : Tensor = prim::GetAttr[name="bias"](%149)
  %input.9 : Tensor = aten::linear(%input.7, %158, %159) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  %input.11 : Tensor = aten::relu_(%input.9) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1204:17
  %162 : bool = prim::GetAttr[name="training"](%150)
  %input.13 : Tensor = aten::dropout(%input.11, %2, %162) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1076:60
  %164 : Tensor = prim::GetAttr[name="weight"](%151)
  %165 : Tensor = prim::GetAttr[name="bias"](%151)
  %x.9 : Tensor = aten::linear(%input.13, %164, %165) # /home/pengwu/local/miniconda3/envs/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:1753:11
  return (%x.9)

